tutorials/BareBonesML/index.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+Title: BareBonesML: Inner workings of ML algorithms
# #+SUBTITLE: /Supervised Algorithms/
#+OPTIONS: \n:t
#+INCLUDE: "../../snippets/darkmode.org" 

This repository contains Python scripts that implement machine learning
algorithms from scratch. The purpose of this repository is to provide simple and
pedagogic implementations of machine learning algorithms to aid in understanding
their inner workings. The focus is on clarity and simplicity, and the code is
not intended to replace standard machine learning libraries for use in
production. 

* Supervised Algorithms
** Support Vector Machine (SVM)
Central to the SVM is the concept of maximizing the margin between classes,
achieved by finding the hyperplane that separates the data points of different
classes while maximizing the distance between the hyperplane and the nearest
data points, known as support vectors.

[[https://github.com/shrisharaob/BarebonesML/blob/main/supervised/support_vector_machine.py][Here is a minimal implementation of SVM]]. This implementation incorporates a
regularization parameter, $\lambda$, which controls the trade-off
between minimizing the training error and preventing overfitting by penalizing
large parameter values. The logic is as follows:

#+begin_src
Input: Training dataset (X, y),
       hyperparameters (learning_rate, lambda_param, num_iterations)

1. Initialize weights (w) and bias (b) to zeros or random small values.

2. Repeat for num_iterations:
     a. Compute the hinge loss:
        L = lambda_param * (sum(max(0, 1 - y * (X * w - b))) / num_samples)
     b. Compute the gradient of the hinge loss with respect to weights:
            dw = (w - lambda_param * y * X) if distance > 0 else w
     c. Compute the gradient of the hinge loss with respect to bias:
            db = -lambda_param * y if distance > 0 else 0
     d. Update weights and bias using gradient descent: 
        w = w - learning_rate * dw
        b = b - learning_rate * db

Output: Trained SVM model with weights (w) and bias (b)
#+end_src


 - X: input features matrix
 - y: target labels
 - =lambda_param=: is the regularization parameter controlling the trade-off
                   between margin maximization and error minimization
 - =learning_rate=: is the step size for gradient descent
 - =num_iterations=: is the number of iterations for gradient descent
                     distance represents the distances between the decision
		     boundary and the training samples
 - =num_samples=: is the number of samples in the training dataset
 - hinge loss: penalizes misclassifications


This works well for datasets which have:
  - no outliers i.e. no overlapping class labels
  - linearly sperable

Real world datasets with noise and non-linear speration boudaries are dealt with
as follows:

*** Dealing with outliers: The Slack term
Slack refers to the allowance of misclassification or errors in the SVM
optimization process. Introducing slack enables SVM to handle linearly/non-linearly
separable data by allowing some data points to fall within the margin or even on
the wrong side of the decision boundary. This flexibility helps SVM generalize
better to complex datasets, although too much slack can lead to overfitting.

*** Dealing with non-linear speration boundires: Kernel Trick
Thee kernel trick is a method used to extend SVMs for non-linear decision
boundaries without explicitly mapping the input data into a higher-dimensional
feature space. It works by implicitly computing the dot product between data
points in a higher-dimensional space, as if they were explicitly mapped. This
allows SVMs to effectively learn complex decision boundaries while avoiding the
computational burden of explicit feature mapping.


Together, */slack/* and the */kernel trick/* contribute to SVMs' ability to handle
diverse datasets and achieve high classification accuracy in various real-world
applications.

