tutorials/BareBonesML/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 04 Dec. 2024 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>BareBonesML: Inner workings of ML algorithms</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Shrisha Rao">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<main id="content">
<header>
<h1 class="title">BareBonesML: Inner workings of ML algorithms</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9055784">Supervised Algorithms</a>
<ul>
<li><a href="#org3078cd6">Support Vector Machine (SVM)</a>
<ul>
<li><a href="#orgaaa0f89">Dealing with outliers: The Slack term</a></li>
<li><a href="#org7682e39">Dealing with non-linear speration boundires: Kernel Trick</a></li>
</ul>
</li>
<li><a href="#orgd231d9a">Naive Bayes</a>
<ul>
<li><a href="#orgaa683bd">Limitations</a></li>
</ul>
</li>
<li><a href="#org502c16a">Ensemble Learning</a>
<ul>
<li><a href="#orgc51edaa">Random Forest (Bagging)</a></li>
<li><a href="#orgda61f63">Gradient Boosting Machine</a></li>
</ul>
</li>
<li><a href="#org1a743d0">Gaussian Discriminant Analysis</a></li>
<li><a href="#org3ada266">K-Nearest Neighbours</a></li>
</ul>
</li>
<li><a href="#org660a28e">Unsupervised Algorithms</a>
<ul>
<li><a href="#org8b9cb7a">K-Means Clustering</a></li>
<li><a href="#orgf9dbcff">PCA</a></li>
</ul>
</li>
<li><a href="#orge5b8526">Sequential Data</a>
<ul>
<li><a href="#org894040e">Hidden Markov Model</a></li>
</ul>
</li>
<li><a href="#orga2f1bcc">Optimization techniques</a>
<ul>
<li><a href="#orge623849">Simulated annealing</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<script src="https://cdn.jsdelivr.net/npm/darkmode-js@1.5.7/lib/darkmode-js.min.js"></script>
<script>
  function addDarkmodeWidget() {
    new Darkmode({
      bottom: '695px', // Remove bottom positioning
      right: '20px', // Remove default right positioning
      left: 'unset', // Remove default left positioning
      label: '🌓', // Custom label/icon
      time: '0.5s', // Transition time
      autoMatchOsTheme: false, // Disable automatic theme matching based on OS preferences
      // location: 'top-right' // Set position to top right
    }).showWidget();
  }
  window.addEventListener('load', addDarkmodeWidget);
</script>

<p>
This repository contains Python scripts that implement machine learning<br>
algorithms from scratch. The purpose of this repository is to provide simple and<br>
pedagogic implementations of machine learning algorithms to aid in understanding<br>
their inner workings. The focus is on clarity and simplicity, and the code is<br>
not intended to replace standard machine learning libraries for use in<br>
production.<br>
</p>

<section id="outline-container-org9055784" class="outline-2">
<h2 id="org9055784">Supervised Algorithms</h2>
<div class="outline-text-2" id="text-org9055784">
</div>
<div id="outline-container-org3078cd6" class="outline-3">
<h3 id="org3078cd6">Support Vector Machine (SVM)</h3>
<div class="outline-text-3" id="text-org3078cd6">
<p>
Central to the SVM is the concept of maximizing the margin between classes,<br>
achieved by finding the hyperplane that separates the data points of different<br>
classes while maximizing the distance between the hyperplane and the nearest<br>
data points, known as support vectors.<br>
</p>

<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/support_vector_machine.py">Here is a minimal implementation of SVM</a>. This implementation incorporates a<br>
regularization parameter, \(\lambda\), which controls the trade-off<br>
between minimizing the training error and preventing overfitting by penalizing<br>
large parameter values. The logic is as follows:<br>
</p>

<pre class="example">
Input: Training dataset (X, y),
       hyperparameters (learning_rate, lambda_param, num_iterations)

1. Initialize weights (w) and bias (b) to zeros or random small values.

2. Repeat for num_iterations:
     a. Compute the hinge loss:
	L = lambda_param * (sum(max(0, 1 - y * (X * w - b))) / num_samples)
     b. Compute the gradient of the hinge loss with respect to weights:
	    dw = (w - lambda_param * y * X) if distance &gt; 0 else w
     c. Compute the gradient of the hinge loss with respect to bias:
	    db = -lambda_param * y if distance &gt; 0 else 0
     d. Update weights and bias using gradient descent: 
	w = w - learning_rate * dw
	b = b - learning_rate * db

Output: Trained SVM model with weights (w) and bias (b)
</pre>


<ul class="org-ul">
<li>X: input features matrix<br></li>
<li>y: target labels<br></li>
<li><code>lambda_param</code>: is the regularization parameter controlling the trade-off<br>
between margin maximization and error minimization<br></li>
<li><code>learning_rate</code>: is the step size for gradient descent<br></li>
<li><code>num_iterations</code>: is the number of iterations for gradient descent<br>
distance represents the distances between the decision<br>
boundary and the training samples<br></li>
<li><code>num_samples</code>: is the number of samples in the training dataset<br></li>
<li>hinge loss: penalizes misclassifications<br></li>
</ul>


<p>
This works well for datasets which have:<br>
</p>
<ul class="org-ul">
<li>no outliers i.e. no overlapping class labels<br></li>
<li>linearly sperable<br></li>
</ul>

<p>
Real world datasets with noise and non-linear speration boudaries are dealt with<br>
as follows:<br>
</p>
</div>

<div id="outline-container-orgaaa0f89" class="outline-4">
<h4 id="orgaaa0f89">Dealing with outliers: The Slack term</h4>
<div class="outline-text-4" id="text-orgaaa0f89">
<p>
Slack refers to the allowance of misclassification or errors in the SVM<br>
optimization process. Introducing slack enables SVM to handle linearly/non-linearly<br>
separable data by allowing some data points to fall within the margin or even on<br>
the wrong side of the decision boundary. This flexibility helps SVM generalize<br>
better to complex datasets, although too much slack can lead to overfitting.<br>
</p>
</div>
</div>

<div id="outline-container-org7682e39" class="outline-4">
<h4 id="org7682e39">Dealing with non-linear speration boundires: Kernel Trick</h4>
<div class="outline-text-4" id="text-org7682e39">
<p>
Thee kernel trick is a method used to extend SVMs for non-linear decision<br>
boundaries without explicitly mapping the input data into a higher-dimensional<br>
feature space. It works by implicitly computing the dot product between data<br>
points in a higher-dimensional space, as if they were explicitly mapped. This<br>
allows SVMs to effectively learn complex decision boundaries while avoiding the<br>
computational burden of explicit feature mapping.<br>
</p>


<p>
Together, <b><i>slack</i></b> and the <b><i>kernel trick</i></b> contribute to SVMs&rsquo; ability to handle<br>
diverse datasets and achieve high classification accuracy in various real-world<br>
applications.<br>
</p>
</div>
</div>
</div>
