tutorials/BareBonesML/index.org
** Naive Bayes
Naive Bayes is a probabilistic algorithm commonly used for classification
tasks. Its simplicity, speed, and effectiveness make it a popular choice for
text classification, spam filtering, and other tasks involving high-dimensional
data with discrete features. The core principle behind Naive Bayes is Bayes'
theorem, which describes the probability of a hypothesis given evidence. In the
context of classification, Naive Bayes calculates the probability of each class
given a set of features and selects the class with the highest probability as
the predicted class for a given instance.

One of the key assumptions of Naive Bayes is the "naive" assumption of feature
independence. This assumption simplifies the calculation of probabilities by
assuming that each feature contributes independently to the probability of a
class label, given the input data. While this assumption may not always hold
true in practice, Naive Bayes often performs remarkably well even when the
independence assumption is violated. Another advantage of Naive Bayes is its
ability to handle large feature spaces efficiently. It requires only a small
amount of training data to estimate the parameters of the probability
distributions, making it particularly useful for datasets with many
features. Despite its simplicity and the simplicity of its underlying
assumptions, Naive Bayes has proven to be effective in a wide range of
real-world applications, making it a valuable tool in the machine learning
practitioner's toolkit.


[[https://github.com/shrisharaob/BarebonesML/blob/main/supervised/naive_bayes.py][Here is a minimal implementation of Naive Bayes Classification]]

The logic as is follows:

#+begin_src
Input: Training dataset (X, y)

1. Calculate prior probabilities for each class:
     a. Count the occurrences of each class label in y.
     b. Divide the count of each class by the total number of samples to get the
        prior probability P(c)

2. For each feature:
     a. Calculate likelihood probabilities for each feature given each class:
          i. Count the occurrences of each feature value in each class.
          ii. Divide the count by the total number of occurrences of that
              feature value in the entire dataset.

3. For each instance x in the test set:
     a. For each class c:
          i. Calculate the posterior probability P(c | x) using Bayes' theorem:
               P(c | x) = P(x | c) * P(c) / P(x)
          ii. Compute the product of likelihood probabilities for each feature
              value in x given class c.
          iii. Multiply the product by the prior probability of class c.
     b. Predict the class with the highest posterior probability as the label
        for instance x.

Output: Predicted class labels for the test set.

#+end_src

*** Limitations
  - *Assumption of Feature Independence*
  - *Handling of Continuous Features*
    Naive Bayes is inherently designed for categorical features and assumes a
    discrete distribution for feature values. While it can handle continuous
    features by discretizing them this discretization may lead to loss of
    information and reduced model performance
  - *Imbalanced Datasets*
    Naive Bayes may exhibit biased predictions on imbalanced datasets, where one
    class significantly outweighs the others. It may prioritize the majority
    class and struggle to accurately classify instances from the minority class,
    particularly when combined with the assumption of feature independence.

Despite these limitations, Naive Bayes remains a popular and useful algorithm,
especially in text classification and other domains with high-dimensional and
sparse feature spaces.

** Ensemble Learning
Ensemble learning is a ML technique that combines the predictions of multiple
individual models to produce a stronger overall prediction. The idea behind
ensemble learning is to leverage the diversity of different models' predictions
to improve the accuracy and robustness of the final prediction. Ensemble methods
can be applied to both classification and regression problems.

The major types of ensemble learning are:

- *Bagging*: Mutiple models are */independently/* trained on a subsets of
  training data. These subsets are obtained by */sampling with replacement/* (i.e
  bootstrap). The predictions of all the models are combined to obtain the final
  prediction either by taking a majority vode (for classification) or averaging
  (for regression).
- *Boosting*: Mutiple weak learners (i.e they perform slightly better than
  chance) are */sequentially/* trained on different */weighted versions/* of the
  data. At each step in the sequence, the subsequent weak learner tries to
  minimize the error on the subset of training datapoints that had the largest
  error in the previous step. 

*Limitations*

- Both Bagging and Boosting methods are good are reducing the variance
- Bagging doesn't reduce the Bias
- Boosting is prone to overfitting


*** Random Forest (Bagging)
Random Forest is popular ensemble learning algorithm based on */Bagging/*.
During the training phase, multiple decision trees are trained.  Each decision
tree in is trained on a bootstraped subset (with replacement) of the training
data and makes predictions based on a random subset of features at each node
split. This */randomness/* introduces diversity among the trees, reducing
overfitting and improving the model's generalization performance.  The final
output is either the mode ormean prediction of the individual trees for
classification or regression, respectively.

It can easily handle high-dimensional datasets with complex interactions between
features. By aggregating predictions from multiple decision trees, Random Forest
can capture a wide range of patterns and relationships present in the data,
making it robust to noisy or incomplete datasets. Additionally, it
can identify the most influential features in the prediction process.


[[https://github.com/shrisharaob/BarebonesML/blob/main/supervised/random_forest.py][Here is the code implementation in python.]] 

Here is the logic:

#+begin_src
Input: Training dataset (X_train, y_train),
       number of trees (n_trees),
       number of features to consider at each split (max_features)

RandomForest(X_train, y_train, n_trees, max_features):
    forest = []
    
    for _ in range(n_trees):
        # Create a bootstrap sample
        X_bootstrap, y_bootstrap = bootstrap_sample(X_train, y_train)
        
        # Train a decision tree on the bootstrap sample
        tree = DecisionTree(X_bootstrap, y_bootstrap, max_features)
        
        # Add the trained tree to the forest
        forest.append(tree)
    
    return forest

DecisionTree(X, y, max_features):
    tree = Tree()
    tree.build(X, y, max_features)
    return tree

bootstrap_sample(X, y):
    indices = random.sample(range(len(X)), len(X))
    return X[indices], y[indices]

predict(forest, X_test):
    predictions = []
    for tree in forest:
        predictions.append(tree.predict(X_test))
    
    # Aggregate predictions from all trees
    # (e.g., using majority voting for classification)
    return aggregate(predictions)
#+end_src


