tutorials/BareBonesML/index.html

<div id="outline-container-orgd231d9a" class="outline-3">
<h3 id="orgd231d9a">Naive Bayes</h3>
<div class="outline-text-3" id="text-orgd231d9a">
<p>
Naive Bayes is a probabilistic algorithm commonly used for classification<br>
tasks. Its simplicity, speed, and effectiveness make it a popular choice for<br>
text classification, spam filtering, and other tasks involving high-dimensional<br>
data with discrete features. The core principle behind Naive Bayes is Bayes&rsquo;<br>
theorem, which describes the probability of a hypothesis given evidence. In the<br>
context of classification, Naive Bayes calculates the probability of each class<br>
given a set of features and selects the class with the highest probability as<br>
the predicted class for a given instance.<br>
</p>

<p>
One of the key assumptions of Naive Bayes is the &ldquo;naive&rdquo; assumption of feature<br>
independence. This assumption simplifies the calculation of probabilities by<br>
assuming that each feature contributes independently to the probability of a<br>
class label, given the input data. While this assumption may not always hold<br>
true in practice, Naive Bayes often performs remarkably well even when the<br>
independence assumption is violated. Another advantage of Naive Bayes is its<br>
ability to handle large feature spaces efficiently. It requires only a small<br>
amount of training data to estimate the parameters of the probability<br>
distributions, making it particularly useful for datasets with many<br>
features. Despite its simplicity and the simplicity of its underlying<br>
assumptions, Naive Bayes has proven to be effective in a wide range of<br>
real-world applications, making it a valuable tool in the machine learning<br>
practitioner&rsquo;s toolkit.<br>
</p>


<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/naive_bayes.py">Here is a minimal implementation of Naive Bayes Classification</a><br>
</p>

<p>
The logic as is follows:<br>
</p>

<pre class="example">
Input: Training dataset (X, y)

1. Calculate prior probabilities for each class:
     a. Count the occurrences of each class label in y.
     b. Divide the count of each class by the total number of samples to get the
	prior probability P(c)

2. For each feature:
     a. Calculate likelihood probabilities for each feature given each class:
	  i. Count the occurrences of each feature value in each class.
	  ii. Divide the count by the total number of occurrences of that
	      feature value in the entire dataset.

3. For each instance x in the test set:
     a. For each class c:
	  i. Calculate the posterior probability P(c | x) using Bayes' theorem:
	       P(c | x) = P(x | c) * P(c) / P(x)
	  ii. Compute the product of likelihood probabilities for each feature
	      value in x given class c.
	  iii. Multiply the product by the prior probability of class c.
     b. Predict the class with the highest posterior probability as the label
	for instance x.

Output: Predicted class labels for the test set.

</pre>
</div>

<div id="outline-container-orgaa683bd" class="outline-4">
<h4 id="orgaa683bd">Limitations</h4>
<div class="outline-text-4" id="text-orgaa683bd">
<ul class="org-ul">
<li><b>Assumption of Feature Independence</b><br></li>
<li><b>Handling of Continuous Features</b><br>
Naive Bayes is inherently designed for categorical features and assumes a<br>
discrete distribution for feature values. While it can handle continuous<br>
features by discretizing them this discretization may lead to loss of<br>
information and reduced model performance<br></li>
<li><b>Imbalanced Datasets</b><br>
Naive Bayes may exhibit biased predictions on imbalanced datasets, where one<br>
class significantly outweighs the others. It may prioritize the majority<br>
class and struggle to accurately classify instances from the minority class,<br>
particularly when combined with the assumption of feature independence.<br></li>
</ul>

<p>
Despite these limitations, Naive Bayes remains a popular and useful algorithm,<br>
especially in text classification and other domains with high-dimensional and<br>
sparse feature spaces.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org502c16a" class="outline-3">
<h3 id="org502c16a">Ensemble Learning</h3>
<div class="outline-text-3" id="text-org502c16a">
<p>
Ensemble learning is a ML technique that combines the predictions of multiple<br>
individual models to produce a stronger overall prediction. The idea behind<br>
ensemble learning is to leverage the diversity of different models&rsquo; predictions<br>
to improve the accuracy and robustness of the final prediction. Ensemble methods<br>
can be applied to both classification and regression problems.<br>
</p>

<p>
The major types of ensemble learning are:<br>
</p>

<ul class="org-ul">
<li><b>Bagging</b>: Mutiple models are <b><i>independently</i></b> trained on a subsets of<br>
training data. These subsets are obtained by <b><i>sampling with replacement</i></b> (i.e<br>
bootstrap). The predictions of all the models are combined to obtain the final<br>
prediction either by taking a majority vode (for classification) or averaging<br>
(for regression).<br></li>
<li><b>Boosting</b>: Mutiple weak learners (i.e they perform slightly better than<br>
chance) are <b><i>sequentially</i></b> trained on different <b><i>weighted versions</i></b> of the<br>
data. At each step in the sequence, the subsequent weak learner tries to<br>
minimize the error on the subset of training datapoints that had the largest<br>
error in the previous step.<br></li>
</ul>

<p>
<b>Limitations</b><br>
</p>

<ul class="org-ul">
<li>Both Bagging and Boosting methods are good are reducing the variance<br></li>
<li>Bagging doesn&rsquo;t reduce the Bias<br></li>
<li>Boosting is prone to overfitting<br></li>
</ul>
</div>


<div id="outline-container-orgc51edaa" class="outline-4">
<h4 id="orgc51edaa">Random Forest (Bagging)</h4>
<div class="outline-text-4" id="text-orgc51edaa">
<p>
Random Forest is popular ensemble learning algorithm based on <b><i>Bagging</i></b>.<br>
During the training phase, multiple decision trees are trained.  Each decision<br>
tree in is trained on a bootstraped subset (with replacement) of the training<br>
data and makes predictions based on a random subset of features at each node<br>
split. This <b><i>randomness</i></b> introduces diversity among the trees, reducing<br>
overfitting and improving the model&rsquo;s generalization performance.  The final<br>
output is either the mode ormean prediction of the individual trees for<br>
classification or regression, respectively.<br>
</p>

<p>
It can easily handle high-dimensional datasets with complex interactions between<br>
features. By aggregating predictions from multiple decision trees, Random Forest<br>
can capture a wide range of patterns and relationships present in the data,<br>
making it robust to noisy or incomplete datasets. Additionally, it<br>
can identify the most influential features in the prediction process.<br>
</p>


<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/random_forest.py">Here is the code implementation in python.</a> <br>
</p>

<p>
Here is the logic:<br>
</p>

<pre class="example">
Input: Training dataset (X_train, y_train),
       number of trees (n_trees),
       number of features to consider at each split (max_features)

RandomForest(X_train, y_train, n_trees, max_features):
    forest = []

    for _ in range(n_trees):
	# Create a bootstrap sample
	X_bootstrap, y_bootstrap = bootstrap_sample(X_train, y_train)

	# Train a decision tree on the bootstrap sample
	tree = DecisionTree(X_bootstrap, y_bootstrap, max_features)

	# Add the trained tree to the forest
	forest.append(tree)

    return forest

DecisionTree(X, y, max_features):
    tree = Tree()
    tree.build(X, y, max_features)
    return tree

bootstrap_sample(X, y):
    indices = random.sample(range(len(X)), len(X))
    return X[indices], y[indices]

predict(forest, X_test):
    predictions = []
    for tree in forest:
	predictions.append(tree.predict(X_test))

    # Aggregate predictions from all trees
    # (e.g., using majority voting for classification)
    return aggregate(predictions)
</pre>
</div>
</div>
