tutorials/BareBonesML/index.html


<div id="outline-container-orgda61f63" class="outline-4">
<h4 id="orgda61f63">Gradient Boosting Machine</h4>
<div class="outline-text-4" id="text-orgda61f63">
<p>
It works by combining multiple weak learners, typically decision trees, to<br>
create a strong learner that can make accurate predictions. Unlike traditional<br>
boosting algorithms that focus on re-weighting misclassified samples, gradient<br>
boosting optimizes the model by sequentially fitting new weak learners to the<br>
residuals or errors made by the previous ones. This iterative process involves<br>
training each new weak learner to predict the residuals left over by the<br>
ensemble of existing weak learners, gradually reducing the errors in<br>
prediction. It is widely used in various domains, including regression,<br>
classification, and ranking tasks, and popular implementations like XGBoost and<br>
LightGBM have made it a cornerstone of modern machine learning workflows.<br>
</p>

<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/gradient_boosting_machine.py">Here is the impementation of gbm from scratch</a><br>
</p>
</div>
</div>
</div>

<div id="outline-container-org1a743d0" class="outline-3">
<h3 id="org1a743d0">Gaussian Discriminant Analysis</h3>
<div class="outline-text-3" id="text-org1a743d0">
<p>
Gaussian Discriminant Analysis (GDA) is a probabilistic generative model used<br>
for classification tasks. In GDA, it is assumed that the features of each class<br>
follow a multivariate normal (Gaussian) distribution. The model estimates the<br>
parameters of these distributions for each class from the training data. By<br>
utilizing Bayes&rsquo; theorem, GDA calculates the posterior probability of each class<br>
given a feature vector. During prediction, the class with the highest posterior<br>
probability is assigned to the input sample. GDA also allows for the estimation<br>
of class priors, which represent the likelihood of encountering each class in<br>
the population. Despite its simplicity and strong assumptions, GDA often<br>
performs well in practice, especially when the underlying data distribution<br>
closely resembles a Gaussian distribution. However, GDA can be sensitive to<br>
deviations from Gaussianity and may not perform optimally in high-dimensional<br>
spaces or with highly skewed or multimodal data.<br>
</p>

<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/gaussian_discriminant_analysis.py">Here is the code</a><br>
</p>
</div>
</div>

<div id="outline-container-org3ada266" class="outline-3">
<h3 id="org3ada266">K-Nearest Neighbours</h3>
<div class="outline-text-3" id="text-org3ada266">
<p>
K-Nearest Neighbors (KNN) is a simple yet powerful supervised machine learning<br>
algorithm used for both classification and regression tasks. In KNN, the<br>
prediction of a new data point is determined by the majority vote (for<br>
classification) or the average (for regression) of its K nearest neighbors in<br>
the feature space. The &ldquo;nearest&rdquo; neighbors are typically defined by a distance<br>
metric, commonly the Euclidean distance. KNN is a non-parametric algorithm,<br>
meaning it does not make explicit assumptions about the underlying data<br>
distribution, and it&rsquo;s often referred to as a lazy learner as it doesn&rsquo;t build a<br>
model during training, instead, <b>it memorizes the entire training dataset</b>. KNN&rsquo;s<br>
simplicity and effectiveness make it a popular choice for many applications,<br>
although it may suffer from computational inefficiency, especially with large<br>
datasets, and it requires careful tuning of the hyperparameter K to balance<br>
between bias and variance.<br>
</p>

<p>
<a href="https://github.com/shrisharaob/BarebonesML/blob/main/supervised/k_nearest.py">Here is the code</a><br>
</p>
</div>
</div>
</section>


<section id="outline-container-org660a28e" class="outline-2">
<h2 id="org660a28e">Unsupervised Algorithms</h2>
<div class="outline-text-2" id="text-org660a28e">
</div>
<div id="outline-container-org8b9cb7a" class="outline-3">
<h3 id="org8b9cb7a">K-Means Clustering</h3>
<div class="outline-text-3" id="text-org8b9cb7a">
<p>
K-Means is an algorithm used for partitioning a dataset into K distinct,<br>
non-overlapping clusters. The algorithm works by iteratively assigning data<br>
points to the nearest cluster centroid and then updating the centroids based on<br>
the mean of the data points assigned to each cluster. This process continues<br>
until the centroids no longer change significantly or a specified number of<br>
iterations is reached. K-means aims to minimize the within-cluster sum of<br>
squares, essentially minimizing the distance between data points within the same<br>
cluster while maximizing the distance between different clusters.<br>
</p>

<p>
Here is the logic:<br>
</p>

<pre class="example">
1. Initialize K cluster centroids randomly.
2. Repeat until convergence:
    a. Assign each data point to the nearest cluster centroid.
    b. Recompute the cluster centroids as the mean of the data points assigned
       to each cluster.
3. Convergence criteria:
    - No change in cluster assignments for any data point.
    - Maximum number of iterations reached.
</pre>

<ul class="org-ul">
<li><a href="https://github.com/shrisharaob/BarebonesML/blob/main/unsupervised/k_means.py">A simple implementation can be found here</a><br></li>
</ul>
</div>
</div>

<div id="outline-container-orgf9dbcff" class="outline-3">
<h3 id="orgf9dbcff">PCA</h3>
<div class="outline-text-3" id="text-orgf9dbcff">
<p>
Principal Component Analysis (PCA) is a dimensionality reduction technique<br>
commonly used in data analysis and machine learning. Its primary goal is to<br>
reduce the dimensionality of a dataset while preserving most of its important<br>
information. PCA achieves this by transforming the original features into a new<br>
set of uncorrelated variables called principal components. These components are<br>
linear combinations of the original features, ordered in such a way that the<br>
first principal component captures the maximum variance in the data, the second<br>
component captures the second highest variance, and so on. By selecting only a<br>
subset of these principal components, often those that capture the most<br>
variance, one can effectively reduce the dimensionality of the dataset while<br>
retaining most of its important characteristics. PCA is widely used for data<br>
visualization, noise reduction, feature extraction, and speeding up machine<br>
learning algorithms by reducing the computational complexity associated with<br>
high-dimensional data.<br>
</p>

<p>
The logic is as follows:<br>
</p>

<ol class="org-ol">
<li>Input: Data matrix X (n x m), where n is the number of samples and m is the<br>
number of features.<br></li>
<li>Compute the mean of each feature and subtract it from the corresponding<br>
feature in each sample to center the data.<br></li>
<li>Compute the covariance matrix of the centered data.<br></li>
<li>Compute the eigenvalues and eigenvectors of the covariance matrix.<br></li>
<li>Sort the eigenvectors by their corresponding eigenvalues in descending order.<br></li>
<li>Select the top k eigenvectors corresponding to the largest eigenvalues to<br>
form the principal components.<br></li>
<li>Project the centered data onto the selected principal components to obtain<br>
the transformed data.<br></li>
<li>Output: Transformed data and the selected principal components.<br></li>
</ol>

<p>
<a href="https://github.com/shrisharaob/BarebonesML/tree/main/unsupervised/pca.py">Here is the code</a><br>
</p>
</div>
</div>
</section>
