tutorials/BareBonesML/index.html


<section id="outline-container-orge5b8526" class="outline-2">
<h2 id="orge5b8526">Sequential Data</h2>
<div class="outline-text-2" id="text-orge5b8526">
</div>
<div id="outline-container-org894040e" class="outline-3">
<h3 id="org894040e">Hidden Markov Model</h3>
<div class="outline-text-3" id="text-org894040e">
<p>
Hidden Markov Models (HMMs) have been succfully used in various fields from<br>
speech recognition to bioinformatics, for modeling sequential data. At its core,<br>
an HMM models the dynamics of the underlying states that influence observed outcomes.<br>
</p>


<p>
Here&rsquo;s how it works:<br>
</p>

<p>
Hidden States: These are the unseen variables that govern the system&rsquo;s<br>
behavior. For instance, in weather forecasting, hidden states could represent<br>
weather conditions like sunny, rainy, or cloudy.<br>
</p>

<p>
Observations: These are the visible outcomes influenced by the hidden<br>
states. For instance, the observable outcomes in weather forecasting could be<br>
temperature, humidity, or precipitation.<br>
</p>

<p>
Transition Probabilities: Hidden Markov Models capture how the system<br>
transitions between hidden states over time.<br>
</p>

<p>
Emission Probabilities: These determine the likelihood of observing a particular<br>
outcome given the current hidden state. For example, in our weather analogy,<br>
emission probabilities could represent the likelihood of observing specific<br>
temperatures or humidity levels for each weather condition.<br>
</p>

<p>
Applications: HMMs find applications in diverse domains. In speech recognition,<br>
they help decipher spoken words by modeling phonetic states and observed<br>
acoustic features. In finance, they forecast market trends by modeling hidden<br>
states representing market conditions.<br>
</p>

<p>
Challenges and Limitations: While HMMs are versatile, they have<br>
limitations. They assume a fixed number of hidden states and discrete<br>
observations, which may not always align with real-world<br>
complexities. Additionally, training HMMs can be computationally intensive.<br>
</p>

<p>
Despite their limitations, Hidden Markov Models remain invaluable for modeling<br>
sequential data and making predictions in various domains. Understanding their<br>
basic principles can unlock a world of possibilities in data analysis and<br>
decision-making.<br>
</p>
</div>
</div>
</section>







<section id="outline-container-orga2f1bcc" class="outline-2">
<h2 id="orga2f1bcc">Optimization techniques</h2>
<div class="outline-text-2" id="text-orga2f1bcc">
</div>
<div id="outline-container-orge623849" class="outline-3">
<h3 id="orge623849">Simulated annealing</h3>
<div class="outline-text-3" id="text-orge623849">
<p>
<b>A technique to find approximate global optimum in hightly rugged energy<br>
landscapes</b><br>
</p>

<p>
Simulated annealing is like a smart explorer searching for the highest peak in a<br>
rugged landscape. Instead of following a strict path, it takes detours and<br>
explores different routes, sometimes even climbing uphill initially. This<br>
randomness allows it to escape from valleys and potentially find the highest<br>
summit. As it progresses, the explorer becomes more methodical, gradually<br>
reducing its willingness to take risky moves, akin to the cooling of a metal<br>
during annealing. Eventually, it settles on a solution that might not be the<br>
absolute peak but is pretty close. This approach is incredibly useful in<br>
tackling complex problems where traditional methods might get stuck in local<br>
optima. Whether it&rsquo;s designing efficient circuits or optimizing logistical<br>
routes, simulated annealing offers a versatile tool to navigate through the<br>
complexities and find near-optimal solutions<br>
</p>

<p>
Here is a demo of how to use simulated annealing to solve the classical<br>
travelling salesman problem:<br>
</p>

<ul class="org-ul">
<li><a href="https://github.com/shrisharaob/BarebonesML/blob/main/optimisation/sim_anneal_tsp.py">Travelling Salesman Problem solved using simulated annealing</a><br></li>
</ul>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 21 Mar. 2024</p>
<p class="author">Author: Shrisha Rao</p>
<p class="date">Created: 04 Dec. 2024</p>
</footer>
</body>
</html>
